tap "cmacrae/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Emacs dependency management
brew "cask"
# Distributed revision control system
brew "git"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Icon set and toolkit
cask "font-fontawesome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Remote desktop client
cask "microsoft-remote-desktop"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Management tool for Unity
cask "unity-hub"
# Active space menu bar icon
cask "whichspace"
